Model: "tiny_inception_net"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
inception_tail (InceptionTai (None, 64, 64, 64)        3387
_________________________________________________________________
incept_A_1 (InceptionResnetA (None, 64, 64, 64)        3664
_________________________________________________________________
incept_A_2 (InceptionResnetA (None, 64, 64, 64)        3664
_________________________________________________________________
reduct_A_1 (InceptionReducti (None, 32, 32, 192)       9600
_________________________________________________________________
incept_B_1 (InceptionResnetB (None, 32, 32, 192)       19824
_________________________________________________________________
incept_B_2 (InceptionResnetB (None, 32, 32, 192)       19824
_________________________________________________________________
incept_B_3 (InceptionResnetB (None, 32, 32, 192)       19824
_________________________________________________________________
incept_B_4 (InceptionResnetB (None, 32, 32, 192)       19824
_________________________________________________________________
reduct_B_2 (InceptionReducti (None, 16, 16, 768)       118272
_________________________________________________________________
incept_C_1 (InceptionResnetC (None, 16, 16, 768)       300480
_________________________________________________________________
incept_C_2 (InceptionResnetC (None, 16, 16, 768)       300480
_________________________________________________________________
bn (BatchNormalization)      (None, 16, 16, 768)       3072
_________________________________________________________________
relu (ReLU)                  (None, 16, 16, 768)       0
_________________________________________________________________
head (TinyImageNetHead)      (None, 200)               153800
=================================================================
Total params: 975,715
Trainable params: 966,851
Non-trainable params: 8,864
_________________________________________________________________
