Model: "tiny_image_net"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
tail (Tail)                  (None, 64, 64, 32)        123
_________________________________________________________________
bottleneck (Bottleneck)      (None, 64, 64, 32)        744
_________________________________________________________________
bottleneck_1 (Bottleneck)    (None, 64, 64, 32)        744
_________________________________________________________________
bottleneck_2 (Bottleneck)    (None, 64, 64, 32)        744
_________________________________________________________________
bottleneck_3 (Bottleneck)    (None, 64, 64, 32)        744
_________________________________________________________________
downsample (Downsample)      (None, 32, 32, 64)        4208
_________________________________________________________________
bottleneck_4 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
bottleneck_5 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
bottleneck_6 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
bottleneck_7 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
bottleneck_8 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
bottleneck_9 (Bottleneck)    (None, 32, 32, 64)        2512
_________________________________________________________________
downsample_1 (Downsample)    (None, 16, 16, 128)       15584
_________________________________________________________________
bottleneck_10 (Bottleneck)   (None, 16, 16, 128)       9120
_________________________________________________________________
bottleneck_11 (Bottleneck)   (None, 16, 16, 128)       9120
_________________________________________________________________
bottleneck_12 (Bottleneck)   (None, 16, 16, 128)       9120
_________________________________________________________________
downsample_2 (Downsample)    (None, 8, 8, 256)         59840
_________________________________________________________________
bn (BatchNormalization)      (None, 8, 8, 256)         1024
_________________________________________________________________
relu (ReLU)                  (None, 8, 8, 256)         0
_________________________________________________________________
head (TinyImageNetHead)      (None, 200)               51400
=================================================================
Total params: 177,587
Trainable params: 174,163
Non-trainable params: 3,424
_________________________________________________________________
