Model: "tiny_image_net"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
tail (Tail)                         (None, 64, 64, 32)              729         
________________________________________________________________________________
bottleneck (Bottleneck)             (None, 64, 64, 32)              744         
________________________________________________________________________________
bottleneck_1 (Bottleneck)           (None, 64, 64, 32)              744         
________________________________________________________________________________
bottleneck_2 (Bottleneck)           (None, 64, 64, 32)              744         
________________________________________________________________________________
downsample (Downsample)             (None, 32, 32, 64)              4208        
________________________________________________________________________________
bottleneck_3 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
bottleneck_4 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
bottleneck_5 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
bottleneck_6 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
bottleneck_7 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
bottleneck_8 (Bottleneck)           (None, 32, 32, 64)              2512        
________________________________________________________________________________
downsample_1 (Downsample)           (None, 16, 16, 128)             15584       
________________________________________________________________________________
bottleneck_9 (Bottleneck)           (None, 16, 16, 128)             9120        
________________________________________________________________________________
bottleneck_10 (Bottleneck)          (None, 16, 16, 128)             9120        
________________________________________________________________________________
bottleneck_11 (Bottleneck)          (None, 16, 16, 128)             9120        
________________________________________________________________________________
bottleneck_12 (Bottleneck)          (None, 16, 16, 128)             9120        
________________________________________________________________________________
downsample_2 (Downsample)           (None, 8, 8, 256)               59840       
________________________________________________________________________________
bn (BatchNormalization)             (None, 8, 8, 256)               1024        
________________________________________________________________________________
relu (ReLU)                         (None, 8, 8, 256)               0           
________________________________________________________________________________
head (TinyImageNetHead)             (None, 200)                     51400       
================================================================================
Total params: 186,569
Trainable params: 182,905
Non-trainable params: 3,664
________________________________________________________________________________
